ys0o8qy/esp32-calendar/sdkconfig.defaults
# Target: Waveshare ESP32-S3-RLCD-4.2 / ESP32-S3-WROOM-1-N16R8
CONFIG_IDF_TARGET="esp32s3"

# Flash / PSRAM profile from board specs: 16MB Flash + 8MB PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# USB Serial/JTAG logs are convenient for ESP32-S3 boards over Type-C
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
